КАКерамика_моя_старая_база/src/Documents/КонтурЛогистика_ПЭ_Титул2/КонтурЛогистика_ПЭ_Титул2.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>КонтурЛогистика_ПЭ_Титул2</name>
  <posting>Deny</posting>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DefinedType.КонтурЛогистика_ДокументыУчетнойСистемы</types>
    </type>
  </attributes>
  <attributes>
    <name>УИД_ПорЭксп</name>
    <comment>Уникальный идентификатор документа (УИД) электронного поручения экпедитору, Выдается государственной информационной системой электронных перевозочных документов</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомДок</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаДок</name>
    <comment>Дата выдачи поручения экспедитору</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СвКлиент</name>
    <type>
      <types>CatalogRef.КонтурЛогистика_ОрганизацииДиадок</types>
    </type>
  </attributes>
  <attributes>
    <name>СвЭксп</name>
    <type>
      <types>CatalogRef.КонтурЛогистика_ОрганизацииДиадок</types>
    </type>
  </attributes>
  <attributes>
    <name>ДогТрЭксп</name>
    <comment>Реквизиты договора транспортной экспедиции</comment>
    <type>
      <types>DefinedType.КонтурЛогистика_Договор</types>
    </type>
  </attributes>
  <attributes>
    <name>Пользователь1с</name>
    <type>
      <types>DefinedType.КонтурЛогистика_Пользователи1С</types>
    </type>
  </attributes>
  <attributes>
    <name>ПользовательПодписант</name>
    <type>
      <types>DefinedType.КонтурЛогистика_Пользователи1С</types>
    </type>
  </attributes>
  <attributes>
    <name>ПараметрНастроекПодписания</name>
    <comment>Параметр используется для поиска подписанта по дополнительному параметру</comment>
    <type>
      <types>DefinedType.КонтурЛогистика_ЗначениеНастроек</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>kl_id</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Титул1</name>
    <type>
      <types>DocumentRef.КонтурЛогистика_ПЭ_Титул1</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ИнфПол</name>
    <comment>Предназначено для обмена информацией не предусмотренной форматом</comment>
    <attributes>
      <name>ИдентификаторСтроки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИдФайлИнфПол</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Идентиф</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ИныеДанныеЭксп</name>
    <attributes>
      <name>ДанныеИОговорки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1000</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДопИнфЭксп</name>
    <comment>Дополнительная информация экспедитора по согласованным и подлежащим оказанию транспортно-экспедиционным услугам</comment>
    <attributes>
      <name>ИдентификаторСтроки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПризИсп</name>
      <type>
        <types>EnumRef.КонтурЛогистика_ТипИсполненияЭкспСвоихОбязательст</types>
      </type>
    </attributes>
    <attributes>
      <name>Услуга</name>
      <type>
        <types>CatalogRef.КонтурЛогистика_ТранспортноЭкспедиционныеУслуги</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>7</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РекИдПредст</name>
      <comment>Реквизиты, позволяющие идентифицировать третье лицо, привлеченное экспедитором</comment>
      <type>
        <types>CatalogRef.КонтурЛогистика_ОрганизацииДиадок</types>
      </type>
    </attributes>
    <attributes>
      <name>ОснОкУслИным</name>
      <comment>Реквизиты документа, определяющего основания для оказания иных услуг, связанных с организацией перевозки груза иным лицом, отличным от экспедитора</comment>
      <type>
        <types>CatalogRef.КонтурЛогистика_Договоры</types>
      </type>
    </attributes>
    <attributes>
      <name>ОбщСтУсл</name>
      <comment>СвОплата</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>18</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НалСт</name>
      <comment>СвОплата</comment>
      <type>
        <types>EnumRef.КонтурЛогистика_СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>НаимДок_СвОплата</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерДок_СвОплата</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаДок_СвОплата</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Валюта</name>
      <type>
        <types>DefinedType.КонтурЛогистика_Валюты</types>
      </type>
    </attributes>
    <attributes>
      <name>НазваниеОрганизации</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИНН</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КПП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>12</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОГРН</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>15</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Телефон</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>25</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Фамилия</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Имя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Отчество</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипЮрЛица</name>
      <type>
        <types>EnumRef.КонтурЛогистика_ТипыЛиц</types>
      </type>
    </attributes>
    <attributes>
      <name>НомераПартий</name>
      <comment>Общий список номеров партий маршрута</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1000</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторыПартий</name>
      <comment>Идентификаторы партий груза </comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1000</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СвТрсГруз</name>
    <attributes>
      <name>ИдентификаторСтрокиРодитель</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторСтроки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИдентПартГруз</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомПартГруз</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Маршрут</name>
      <type>
        <types>DocumentRef.КонтурЛогистика_ПЭ_ЗаявкаНаМаршрут</types>
      </type>
    </attributes>
    <attributes>
      <name>МаршСлГруз</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1000</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СвТсДост</name>
    <comment>Сведения о транспортном средстве, на котором будет осуществлена доставка груза</comment>
    <attributes>
      <name>ИдентификаторСтрокиРодитель</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторСтроки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТранспортноеСредство</name>
      <type>
        <types>CatalogRef.КонтурЛогистика_ТранспортныеСредства</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидТС</name>
      <type>
        <types>EnumRef.КонтурЛогистика_ВидыТранспорта</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипКузова</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РегНомер</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>9</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Марка</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Модель</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Водители</name>
    <comment>СвВодители</comment>
    <attributes>
      <name>ИдентификаторСтрокиРодитель</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Водитель</name>
      <type>
        <types>CatalogRef.КонтурЛогистика_Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>РеквНаимДок</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РеквНомерДок</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РеквДатаДок</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

КАКерамика_моя_старая_база/src/InformationRegisters/КонтурЛогистика_ДвижениеДокументооборота/КонтурЛогистика_ДвижениеДокументооборота.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КонтурЛогистика_ДвижениеДокументооборота</name>
  <comment>время периода по МСК!</comment>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Состояние</name>
    <comment>kl-status из сервиса: Титул.CustomData</comment>
    <type>
      <types>CatalogRef.КонтурЛогистика_СостоянияДвиженияДокументооборота</types>
    </type>
  </resources>
  <attributes>
    <name>Пользователь1С</name>
    <type>
      <types>DefinedType.КонтурЛогистика_Пользователи1С</types>
    </type>
  </attributes>
  <attributes>
    <name>ФайлОбмена</name>
    <type>
      <types>CatalogRef.КонтурЛогистика_ФайлыОбмена</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторСобытия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КаналТранспорта</name>
    <type>
      <types>EnumRef.КонтурЛогистика_КаналыТранспорта</types>
    </type>
  </attributes>
  <dimensions>
    <name>Документ</name>
    <type>
      <types>DocumentRef.КонтурЛогистика_ЭлектроннаяТранспортнаяНакладная</types>
      <types>DocumentRef.КонтурЛогистика_ЭкспедиторскаяРасписка</types>
      <types>DocumentRef.КонтурЛогистика_ПЛ_Титул1_5_02</types>
      <types>DocumentRef.КонтурЛогистика_ПЭ_Титул1</types>
      <types>DocumentRef.КонтурЛогистика_ЭлектроннаяСопроводительнаяВедомость</types>
      <types>DocumentRef.КонтурЛогистика_ЗЗ_Титул1</types>
      <types>DocumentRef.КонтурЛогистика_ЭлектронныйЗаказНаряд</types>
      <types>DocumentRef.КонтурЛогистика_ПЛ_Титул1</types>
      <types>DocumentRef.КонтурЛогистика_СкладскаяРасписка</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

КАКерамика_моя_старая_база/src/Enums/КонтурЛогистика_ТипИсполненияЭкспСвоихОбязательст/КонтурЛогистика_ТипИсполненияЭкспСвоихОбязательст.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>КонтурЛогистика_ТипИсполненияЭкспСвоихОбязательст</name>
  <enumValues>
    <name>_1</name>
  </enumValues>
  <enumValues>
    <name>_2</name>
  </enumValues>
  <enumValues>
    <name>_3</name>
  </enumValues>
</mdclass:Enum>

КАКерамика_моя_старая_база/src/Documents/КонтурЛогистика_ПЭ_Титул2/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Элементы.ФормаВвестиЭР.Видимость = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЗначениеНастройки("ИспользуетсяЭкспедиторскаяРасписка");
	Элементы.ФормаВвестиСР.Видимость = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЗначениеНастройки("ИспользуетсяСкладскаяРасписка");
	
	ОбновитьДанныеФормы();
	ЗаполнитьТаблицуУслуг();
	ЗаполнитьТаблицуТСиВодители();
	ЗаполнитьДанныеПоУпаковкамГруза();
	
	КонтурЛогистика_ОбщегоНазначенияСервер.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	ПроверитьДокумент();
	
	ПересчитатьЗаголовкиКоличества();
	
	ОтборСтрок = Новый ФиксированнаяСтруктура("ИдентификаторСтрокиОтметки", "");
	
	РазвернутьСвернутьТаблицуТСиВодители();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "КонтурЛогистика_ИзменениеДокумента" И Параметр = Объект.Ссылка Тогда 
		
		ПодключитьОбработчикОжидания("ОбработчикПеречитатьОбъект", 0.1, Истина);
		
	ИначеЕсли ИмяСобытия = "КонтурЛогистика_ЗакрытьФормыТитулов" 
		И Параметр <> Неопределено 
		И ТипЗнч(Параметр) = Тип("Массив") 
		И Параметр.Найти(Объект.Ссылка) <> Неопределено Тогда 
		
		ПодключитьОбработчикОжидания("ОбработчикЗакрытьФорму", 0.1, Истина);
		
	ИначеЕсли ИмяСобытия = "КонтурЛогистика_ОбновитьДокументЛогистики" Тогда
		
		ПодключитьОбработчикОжидания("ОбработчикПеречитатьОбъект", 0.1, Истина);

	ИначеЕсли ИмяСобытия = "КонтурЛогистика_ПерепроверитьДокумент" Тогда
		
		ПодключитьОбработчикОжидания("ПроверитьДокумент", 0.1, Истина);
		
	ИначеЕсли ИмяСобытия = "КонтурЛогистика_ОбновитьФормуТитула" Тогда
		
		ОбновитьФорму();
		
	ИначеЕсли ИмяСобытия = "КонтурЛогистика_ОбновитьЗадачи"
			  И Параметр <> Неопределено
			  И ТипЗнч(Параметр) = Тип("Массив")
			  И Параметр.Найти(Объект.Ссылка) <> Неопределено Тогда

		ПодключитьОбработчикОжидания("ОбработчикПеречитатьОбъект", 0.1, Истина);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьВыборДокументаОснования(ВыбранноеЗначение, ДополнительныеПараметры) Экспорт
	
	КонтурЛогистика_РаботаСЭлементамиФормыКлиент.ОбработатьВыборДокументаОснование(ВыбранноеЗначение, Объект, ЭтаФорма);
			
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикПеречитатьОбъект()

	ЭтаФорма.Прочитать();
	ОбновитьФорму();

КонецПроцедуры

&НаКлиенте
Процедура ОбработчикЗакрытьФорму()

	ЭтаФорма.Закрыть();

КонецПроцедуры

&НаКлиенте
Процедура ОбработчикПерепроверить(Параметр1 = Неопределено, Параметр2 = Неопределено) Экспорт
	
	ПроверитьДокумент();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикДобавленияУслуги(Данные = Неопределено, КонтекстФормы = Неопределено) Экспорт
	
	Если Данные = Неопределено Тогда
		Возврат;
	КонецЕсли;
		
	Если Данные.ВидОперации = "Удаление" Тогда
		
		УдалитьУслугуНаСервере(Данные.ИдентификаторСтрокиУслуги);
	
	ИначеЕсли Данные.ВидОперации = "Добавление" Тогда
		
		Если ЗначениеЗаполнено(Данные.Услуга.Услуга) Тогда

			ДобавитьУслугуНаСервере(Данные);
		
		КонецЕсли;
		
	ИначеЕсли Данные.ВидОперации = "Изменение" Тогда
			
		УдалитьУслугуНаСервере(Данные.ИдентификаторСтрокиУслуги);	
		ДобавитьУслугуНаСервере(Данные);
		
	КонецЕсли;	 	

	Модифицированность = Истина;
	ПересчитатьЗаголовкиКоличества();
	
	ПроверитьДокумент();
	
КонецПроцедуры	

#КонецОбласти

#Область ОбработчикиСобытийГруппаДополнительнаяИнформация
&НаКлиенте
Процедура ДекорацияПосмотретьДанныеПоКонтейнерамНажатие(Элемент)
	
	ДанныеФормы = Новый Структура;
	ДанныеФормы.Вставить("Ключ", Элементы.Грузы.ТекущиеДанные.Ссылка);
	ДанныеФормы.Вставить("ОткрытьСтраницуКонтейнер", Истина);
	
	КонтурЛогистика_ОбщегоНазначенияКлиент.ОткрытьФорму_Подсистемы("Документ.КонтурЛогистика_ПЭ_ЗаявкаНаМаршрут.Форма.ФормаДокумента",
		ДанныеФормы, , ЭтаФорма);
	
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытийТабличнойЧастиТСиВодители

&НаКлиенте
Процедура ТСиВодителиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(Элементы.ТСиВодители.ТекущиеДанные.Водитель) Тогда

		СтандартнаяОбработка = Ложь;
		ИдентификаторСтроки = Элементы.ТСиВодители.ТекущиеДанные.ИдентификаторСтроки;
		ИдентификаторМаршрут  = Элементы.ТСиВодители.ТекущиеДанные.ИдентификаторМаршрут;
		РежимРаботы = "ИзменитьТранспорт";
		ОткрытьФормуУслуги(РежимРаботы, Элементы.ТСиВодители.ТекущиеДанные.СсылкаМаршрут, ИдентификаторСтроки, ИдентификаторМаршрут);
		
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийТабличнойЧастиУслуги

&НаКлиенте
Процедура УслугиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Элементы.Услуги.ТекущиеДанные.СсылкаМаршрут) Тогда
		
		СтандартнаяОбработка = Ложь;
		
		ИдентификаторСтроки = Элементы.Услуги.ТекущиеДанные.ИдентификаторСтроки;
		ИдентификаторСтрокиМаршрут =Элементы.Услуги.ТекущиеДанные.ИдентификаторСтрокиМаршрут; 
		
		СтрокиТранспорт = Объект.СвТсДост.НайтиСтроки(Новый Структура("ИдентификаторСтрокиРодитель", ИдентификаторСтрокиМаршрут));
		Если СтрокиТранспорт.Количество() = 0 тогда 
			РежимРаботы = "ИзменитьУслугу";	
		Иначе		
			РежимРаботы = "ИзменитьТранспорт";
		КонецЕсли;
		
		ОткрытьФормуУслуги(РежимРаботы, Элементы.Услуги.ТекущиеДанные.СсылкаМаршрут, ИдентификаторСтроки, ИдентификаторСтрокиМаршрут);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийТабличнойЧастиГрузы

&НаКлиенте
Процедура ГрузыПриАктивизацииСтроки(Элемент)
	
	Если ВходящийПЭ2() Тогда
		Возврат ;
	КонецЕсли;	
		
	Если Элемент.ТекущиеДанные = Неопределено Тогда
		Элементы.ГруппаДополнительнаяИнформация.Видимость = Ложь;
		Элементы.ГруппаДопИнформацияТовары.Видимость = Ложь;
		Возврат ;
	КонецЕсли;	
	
	КорневойЭлемент = (Элемент.ТекущиеДанные.ПолучитьРодителя() = Неопределено);
	Элементы.ГруппаДополнительнаяИнформация.Видимость = КорневойЭлемент;
	Элементы.ГруппаДопИнформацияТовары.Видимость = Не КорневойЭлемент;
	
	Если Элементы.ГруппаДопИнформацияТовары.Видимость Тогда
		
		ОтборСтрок = Новый ФиксированнаяСтруктура("ИдентификаторСтроки", Элемент.ТекущиеДанные.ИдентификаторСтроки);
		Элементы.УпаковкаТовара.ОтборСтрок = ОтборСтрок;
		
		Элементы.ГруппаГосучет.Видимость = Элемент.ТекущиеДанные.Госучет;
		Элементы.ГруппаОпасный.Видимость = Элемент.ТекущиеДанные.Опасный;
		Элементы.ГруппаОграниченВОбороте.Видимость = Элемент.ТекущиеДанные.ОграниченВОбороте;
	
	ИначеЕсли Элементы.ГруппаДополнительнаяИнформация.Видимость Тогда
		
		Элементы.ГруппаСведенияОКонтейнерах.Видимость = Элемент.ТекущиеДанные.ЕстьДанныеОконтейнерах;
		
		Элементы.ГруппаТемпературныйРежим.Видимость = Элемент.ТекущиеДанные.ЕстьОсобыеУсловияПеревозки;
		Элементы.ГруппаВлажность.Видимость = Элемент.ТекущиеДанные.ЕстьОсобыеУсловияПеревозки;
		Элементы.ГруппаПрочее.Видимость = Элемент.ТекущиеДанные.ЕстьОсобыеУсловияПеревозки;
		
		Элементы.ГруппаОсобыеУсловияПеревозки.Видимость = НЕ Элемент.ТекущиеДанные.ЕстьОсобыеУсловияПеревозки;
		
		Маршрут = Элементы.Грузы.ТекущиеДанные.Ссылка;
	
		СтрокиМаршруты = ТСиВодители.ПолучитьЭлементы();
		ЕстьУслуга = Ложь;
		Для Каждого СтрокаМаршрут Из СтрокиМаршруты Цикл
			Если СтрокаМаршрут.Маршрут = Маршрут Тогда
				ЕстьУслуга = Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;
			
		Если ЕстьУслуга Тогда
			Элементы.ДобавитьТСВодителя.Заголовок = "Изменить ТС и водителя";
		Иначе 
			Элементы.ДобавитьТСВодителя.Заголовок = "Добавить ТС и водителя";	 
		КонецЕсли;	 	
		
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПанельОшибокМинимизировать(Команда)
	КонтурЛогистика_ПанельОшибокКлиент.МинимизироватьПанельОшибок(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ПанельОшибокМаксимизировать(Команда)
	КонтурЛогистика_ПанельОшибокКлиент.ПоказатьПанельОшибок(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ПанельОшибокСвернутьРазвернуть(Команда)
	ПанельОшибокСвернутьРазвернутьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьНастройкуКонвертации(Команда)

	КонтурЛогистика_ОбработкаДокументовКлиент.ОткрытьНастройкуКонвертации(
		ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТипыЛогистическихДокументов.ПЭ_Титул2"), Неопределено);

КонецПроцедуры

&НаКлиенте
Процедура ПерезаполнитьПоДокОснованию(Команда)

	ПерезаполнитьПоДокОснованиюСервер();
	ОбновитьДанныеФормы();

	ПолностьюОбновитьПредставлениеДанных();

КонецПроцедуры

&НаКлиенте
Процедура ПеречитатьОбъект(Команда)

	ОбработчикПеречитатьОбъект();

КонецПроцедуры

&НаКлиенте
Процедура ПоказатьПараметрыПодписи(Команда)
	
	МассивКонструктораКлюча = ПолучитьПараметрыПодписиНаСервере(Объект.СвЭксп, Объект.ПользовательПодписант, 
			Объект.ПараметрНастроекПодписания);

	КлючЗаписи = Новый ("РегистрСведенийКлючЗаписи.КонтурЛогистика_НастройкиПодписания", МассивКонструктораКлюча);
	ПараметрыФормы = Новый Структура("Ключ", КлючЗаписи);
	
	КонтурЛогистика_ОбщегоНазначенияКлиент.ОткрытьФорму_Подсистемы(
			"РегистрСведений.КонтурЛогистика_НастройкиПодписания.Форма.ФормаЗаписи", ПараметрыФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура ВвестиЭР(Команда)
	
	Если ЗначениеЗаполнено(Объект.Ссылка)
		И КодТекущегоСтатусаДокументооборота = "pe-completed" Тогда
		
		Если Грузы.ПолучитьЭлементы().Количество() = 1 Тогда
			
			// Открываем сразу экспедиторскую расписку
			ПараметрыФормы = Новый Структура("Основание", Объект.Ссылка);
			ИмяОткрываемойФормы = "Документ.КонтурЛогистика_ЭкспедиторскаяРасписка.ФормаОбъекта";
			КонтурЛогистика_ОбщегоНазначенияКлиент.ОткрытьФорму_Подсистемы(ИмяОткрываемойФормы, ПараметрыФормы,, ЭтаФорма);
			
		Иначе
			
			// Открываем мастер
			ПараметрыФормы = Новый Структура("ДокументОснования", Объект.Титул1);
			ИмяОткрываемойФормы = "Документ.КонтурЛогистика_ЭкспедиторскаяРасписка.Форма.МастерСозданияЭспедиторскихРасписок";
			КонтурЛогистика_ОбщегоНазначенияКлиент.ОткрытьФорму_Подсистемы(ИмяОткрываемойФормы, ПараметрыФормы,, ЭтаФорма);
			
		КонецЕсли;
		
		КонтурЛогистика_Метрика.ЗарегистрироватьДействиеПользователя(
			"Оформление ЭР", "Оформить ЭР", "Документ.КонтурЛогистика_ПЭ_Титул2.Форма.ФормаДокумента", "ЭР");
		
	Иначе
		
		Сообщить("Оформить экспедиторскую расписку можно только после подписания титула 2 поручения экспедитора");
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВвестиСР(Команда)
	
	Если ЗначениеЗаполнено(Объект.Ссылка)
		И КодТекущегоСтатусаДокументооборота = "pe-completed" Тогда
		
		Если Грузы.ПолучитьЭлементы().Количество() = 1 Тогда
			
			// Открываем сразу складскую расписку
			ПараметрыФормы = Новый Структура("Основание", Объект.Ссылка);
			ИмяОткрываемойФормы = "Документ.КонтурЛогистика_СкладскаяРасписка.ФормаОбъекта";
			КонтурЛогистика_ОбщегоНазначенияКлиент.ОткрытьФорму_Подсистемы(ИмяОткрываемойФормы, ПараметрыФормы,, ЭтаФорма);
			
		Иначе
			
			// Открываем мастер
			ПараметрыФормы = Новый Структура("ДокументОснования", Объект.Титул1);
			ИмяОткрываемойФормы = "Документ.КонтурЛогистика_СкладскаяРасписка.Форма.МастерСозданияСкладскихРасписок";
			КонтурЛогистика_ОбщегоНазначенияКлиент.ОткрытьФорму_Подсистемы(ИмяОткрываемойФормы, ПараметрыФормы,, ЭтаФорма);
			
		КонецЕсли;
		
		КонтурЛогистика_Метрика.ЗарегистрироватьДействиеПользователя(
			"Оформление СР", "Оформить СР", "Документ.КонтурЛогистика_ПЭ_Титул2.Форма.ФормаДокумента", "СР");
		
	Иначе
		
		Сообщить("Оформить складскую расписку можно только после подписания титула 2 поручения экспедитора");
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьУслугу(Команда)
	
	Маршрут = Элементы.Грузы.ТекущиеДанные.Ссылка;
	РежимРаботы = "ДобавитьУслугу";
	ОткрытьФормуУслуги(РежимРаботы, Маршрут);
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьТСВодителя(Команда)
	
	Маршрут = Элементы.Грузы.ТекущиеДанные.Ссылка;
	
	СтрокиМаршруты = ТСиВодители.ПолучитьЭлементы();
	
	РежимРаботы = "ДобавитьТСиВодитель";
	ИдентификаторСтроки = "";
	ИдентификаторМаршрут = "";
	
	Для Каждого СтрокаМаршрут Из СтрокиМаршруты Цикл
		Если СтрокаМаршрут.Маршрут = Маршрут Тогда
			ИдентификаторСтроки = СтрокаМаршрут.ИдентификаторСтроки;
			ИдентификаторМаршрут  = СтрокаМаршрут.ИдентификаторМаршрут;
			РежимРаботы = "ИзменитьТранспорт";
			Прервать;
		КонецЕсли;	
	КонецЦикла;	
	
	ОткрытьФормуУслуги(РежимРаботы, Маршрут, ИдентификаторСтроки, ИдентификаторМаршрут);
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьУслугу(Команда)
	
	УдалитьУслугуНаСервере(Элементы.Услуги.ТекущиеДанные.ИдентификаторСтроки);
	ВыполнитьДействияПослеУдаления();
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьТС(Команда)
	
	ОчиститьТранспортВодителейПоИдентификатору(Элементы.ТСиВодители.ТекущиеДанные.ИдентификаторТранспорт);
	ВыполнитьДействияПослеУдаления();
	
КонецПроцедуры

&НаКлиенте
Процедура ПосмотретьВыписанныеЭР(Команда)
	
	ДанныеЗаполнения = Новый Структура("Титул1", Объект.Титул1); 
	
	КонтурЛогистика_ОбщегоНазначенияКлиент.ОткрытьФорму_Подсистемы("Документ.КонтурЛогистика_ПЭ_Титул2.Форма.ФормаПросмотрВыписанныхЭР",
			ДанныеЗаполнения, , ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьЗЗ(Команда)
	
		Если Грузы.ПолучитьЭлементы().Количество() = 1 Тогда
			
			// Открываем сразу ЗЗ
			ДанныеЗаполнения = Новый Структура("ДокументОснование", Грузы.ПолучитьЭлементы()[0].Ссылка);
			ДанныеЗаполнения.Вставить("ТипЛогистика", ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТипыЛогистическихДокументов.ЗЗ_Титул1"));
			
			ПараметрыФормы = Новый Структура("Основание", ДанныеЗаполнения);
			ИмяОткрываемойФормы = "Документ.КонтурЛогистика_ЗЗ_Титул1.ФормаОбъекта";
			КонтурЛогистика_ОбщегоНазначенияКлиент.ОткрытьФорму_Подсистемы(ИмяОткрываемойФормы, ПараметрыФормы,, ЭтаФорма);
			
		Иначе
			
			// Открываем мастер
			ПараметрыФормы = Новый Структура("ДокументОснования", Объект.Титул1);
			ПараметрыФормы.Вставить("РежимИспользования", "ЗаказЗаявка");
			ИмяОткрываемойФормы = "Документ.КонтурЛогистика_ЭкспедиторскаяРасписка.Форма.МастерСозданияЭспедиторскихРасписок";
			КонтурЛогистика_ОбщегоНазначенияКлиент.ОткрытьФорму_Подсистемы(ИмяОткрываемойФормы, ПараметрыФормы,, ЭтаФорма);
			
		КонецЕсли;
		
		КонтурЛогистика_Метрика.ЗарегистрироватьДействиеПользователя(
			"Оформление ЗЗ", "Оформить ЗЗ", "Документ.КонтурЛогистика_ПЭ_Титул2.Форма.ФормаДокумента");
		
КонецПроцедуры

&НаКлиенте
Процедура Перепроверить(Команда)
	ПроверитьДокумент();
КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ВыполнитьДействияПослеУдаления()
	
	Модифицированность = Истина;
	ЗаполнитьТаблицуУслуг();
	ЗаполнитьТаблицуТСиВодители();
	
	РазвернутьСвернутьТаблицуТСиВодители();
	
	ПересчитатьЗаголовкиКоличества();
	
КонецПроцедуры	

&НаКлиенте
Процедура ПересчитатьЗаголовкиКоличества()

	Элементы.СтраницаУслуги.Заголовок = "Услуги (" + Услуги.ПолучитьЭлементы().Количество() + ")";
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуУслуги(РежимРаботы, Маршрут, ИдентификаторСтроки = "", ИдентификаторМаршрут = "")
	
	ДанныеЗаполнения = Новый Структура("РежимРаботы, Маршрут, Услуга, Титул1", РежимРаботы, Маршрут);
	ДанныеЗаполнения.Титул1 = Объект.Титул1;
	
	Если ВходящийПЭ2() Тогда 
		ДанныеЗаполнения.Вставить("ТолькоПросмотрДокумента", Истина);
	КонецЕсли;	 
	
	Если РежимРаботы = "ИзменитьУслугу" Тогда
		ДанныеЗаполнения.Услуга = ПолучитьДанныеПоУслуге(ИдентификаторСтроки);
	ИначеЕсли РежимРаботы = "ИзменитьТранспорт"	Тогда
		ДанныеЗаполнения.Услуга = ПолучитьДанныеПоУслуге(ИдентификаторСтроки);
		ДанныеЗаполнения.Вставить("Транспорт", ПолучитьДанныеПоТранспорту(ИдентификаторМаршрут)); 
	КонецЕсли;	
	
	КонтурЛогистика_ОбщегоНазначенияКлиент.ОткрытьФорму_Подсистемы("Документ.КонтурЛогистика_ПЭ_Титул2.Форма.ФормаУказанияУслуги",
			ДанныеЗаполнения, , ЭтаФорма, "ОбработчикДобавленияУслуги",);
	
КонецПроцедуры

&НаКлиенте
Функция ПолучитьДанныеПоТранспорту(ИдентификаторМаршрут)
	
	ДанныеТранспорт = Новый Массив();

	СтрокиТранспорт = Объект.СвТсДост.НайтиСтроки(Новый Структура("ИдентификаторСтрокиРодитель", ИдентификаторМаршрут));
	Для Каждого ТС Из СтрокиТранспорт Цикл

		ТранспортСтруктура = Новый Структура("МассивВодителей, Транспорт, ТипТранспорта, ИдентификаторСтроки, ИдентификаторРодитель");
		ТранспортСтруктура.Транспорт = ТС.ТранспортноеСредство;
		ТранспортСтруктура.ТипТранспорта = ТС.ВидТС;
		ТранспортСтруктура.ИдентификаторСтроки = ТС.ИдентификаторСтроки;
		ТранспортСтруктура.ИдентификаторРодитель = ТС.ИдентификаторСтрокиРодитель;

		СтрокиВодители = Объект.Водители.НайтиСтроки(Новый Структура("ИдентификаторСтрокиРодитель", ТС.ИдентификаторСтроки));

		МассивВодителей = Новый Массив();
		Для Каждого СтрокаВодитель Из СтрокиВодители Цикл
			МассивВодителей.Добавить(СтрокаВодитель.Водитель);
		КонецЦикла;

		ТранспортСтруктура.МассивВодителей = МассивВодителей;
		ДанныеТранспорт.Добавить(ТранспортСтруктура);

	КонецЦикла;
	
	Возврат ДанныеТранспорт;
	
КонецФункции		

&НаКлиенте
Функция ПолучитьДанныеПоУслуге(Идентификатор)
	
	Отбор = Новый Структура("ИдентификаторСтроки", Идентификатор);
	Поля  = "ПризИсп, Услуга, Количество, РекИдПредст, ОснОкУслИным, ОбщСтУсл, НалСт, НаимДок_СвОплата,
				| НомерДок_СвОплата, ДатаДок_СвОплата, ИдентификаторСтроки, Валюта, 
				|ТипТранспорта, НазваниеОрганизации, ИНН, КПП, ОГРН, Телефон, Фамилия, Имя, Отчество, ТипЮрЛица";
	
	СтрокиУслуг = Объект.ДопИнфЭксп.НайтиСтроки(Отбор);
	Результат = Новый Структура(Поля);
	
	Для Каждого Услуга Из СтрокиУслуг Цикл
		ЗаполнитьЗначенияСвойств(Результат, Услуга);
	КонецЦикла;
		  
	Результат.Вставить("Исполнитель", Услуга.ПризИсп = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТипИсполненияЭкспСвоихОбязательст._1"));  	  
	
	Возврат Результат;
	
КонецФункции	

&НаСервере
Процедура ОбновитьДанныеФормы()
	
	ЗаполнитьГрузыПоМаршрутам();
	
	ТекущийСтатус = РегистрыСведений.КонтурЛогистика_СтатусыТитулов.ПолучитьСтатус(Объект.Ссылка, Истина);
	ТекущийСтатусДокументооборота = РегистрыСведений.КонтурЛогистика_ДвижениеДокументооборота.ПолучитьСтатус(
		Объект.Титул1, Истина);
	КодТекущегоСтатусаДокументооборота = ТекущийСтатусДокументооборота.Код;
	
	СтатусСтрокой = Строка(ТекущийСтатус) + "; " + Строка(ТекущийСтатусДокументооборота.ТребуемоеДействиеТ2);
	
	ЗадачаПроверить = (КодТекущегоСтатусаДокументооборота = "pe-сheckAnswer");
	Элементы.ФормаОбщаяКомандаКонтурЛогистика_ПроверкаОтветаПройдена.Видимость = ЗадачаПроверить;
	Элементы.ФормаОбщаяКомандаКонтурЛогистика_ПроверкаОтветаПройдена.КнопкаПоУмолчанию = ЗадачаПроверить;
	
	Заголовок = Строка(ТекущийСтатус);
	
	Если Не ЗадачаПроверить Тогда
		КонтурЛогистика_ОбработкаДокументовСервер.УстановитьЗаголовокКнопкеПоУмолчанию(Объект.Ссылка, Неопределено,
			Элементы.ФормаОбщаяКомандаКонтурЛогистика_ВыполнитьДействияПоУмолчанию, ТекущийСтатус);
	Иначе
		Элементы.ФормаОбщаяКомандаКонтурЛогистика_ВыполнитьДействияПоУмолчанию.Видимость = Ложь;
	КонецЕсли;
			
	Элементы.Титул1ДокументШаблон.Видимость = ЗначениеЗаполнено(Объект.Титул1.ДокументШаблон);		
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьФорму()

	ОбновитьДанныеФормы();
	ПолностьюОбновитьПредставлениеДанных();
	
КонецПроцедуры

&НаКлиенте
Процедура ПолностьюОбновитьПредставлениеДанных()

	// ЗаполнитьПредставлениеРеквизитовДокументаОснования();
	ПроверитьДокумент(); // вызовет УправлениеВидимостьюИДоступностью();

КонецПроцедуры

&НаСервере
Процедура ПанельОшибокСвернутьРазвернутьНаСервере()
	КонтурЛогистика_ПанельОшибокСервер.ПанельОшибокСвернутьРазвернуть(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаОшибокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	КонтурЛогистика_ПанельОшибокКлиент.ТаблицаОшибокВыбор(ЭтаФорма, Объект, Поле.Имя);
КонецПроцедуры

&НаКлиенте
Функция ПроверитьДокумент()

	РезультатПроверки = ПроверитьДокументСервер();

	КонтурЛогистика_ПанельОшибокКлиент.ОбновитьСостояниеПанели(ТекущийСтатус, ЭтаФорма, РезультатПроверки, КодТекущегоСтатусаДокументооборота = "zz-rejected");

	УправлениеВидимостьюИДоступностью(); 	// доступность команд

	Возврат РезультатПроверки;

КонецФункции

&НаСервере
Функция ПроверитьДокументСервер()

	ДокОбъект = РеквизитФормыВЗначение("Объект");
	
	РезультатПроверки = Документы.КонтурЛогистика_ПЭ_Титул2.ПроверитьДокумент(ДокОбъект, ТаблицаОшибок);

	Возврат РезультатПроверки;

КонецФункции

&НаКлиенте
Процедура ОбработатьТребуемоеДействие(ТребуемоеДействие, ПолеТаблицыОшибок = Неопределено)
	
	Если ПолеТаблицыОшибок <> Неопределено Тогда
		КонтурЛогистика_ПанельОшибокКлиент.ТаблицаОшибокВыбор(ЭтаФорма, Объект, ПолеТаблицыОшибок.Имя);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура УправлениеВидимостьюИДоступностью()
	
	УстановитьТолькоПросмотр = (ТекущийСтатус <> ПредопределенноеЗначение("Перечисление.КонтурЛогистика_СтатусыТитулов.Черновик")
		И ТекущийСтатус <> ПредопределенноеЗначение("Перечисление.КонтурЛогистика_СтатусыТитулов.Ошибка"));
	
	Элементы.ОсновнаяЧастьФормы.ТолькоПросмотр = УстановитьТолькоПросмотр;
	Элементы.ДобавитьТСВодителя.Доступность = Не УстановитьТолькоПросмотр;
	Элементы.ДобавитьУслуги.Доступность = Не УстановитьТолькоПросмотр;
	Элементы.УслугиКонтекстноеМенюУдалить.Доступность = Не УстановитьТолькоПросмотр;
	Элементы.ТСиВодителиКонтекстноеМенюУдалить.Доступность = Не УстановитьТолькоПросмотр;
	
	Если ВходящийПЭ2() Тогда
		Элементы.ГруппаДополнительнаяИнформация.Видимость = Ложь;
		Элементы.ГруппаДопИнформацияТовары.Видимость = Ложь;
		Элементы.ФормаВвестиЭР.Видимость = Ложь;
		Элементы.ФормаВвестиСР.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПерезаполнитьПоДокОснованиюСервер()

	Если ЗначениеЗаполнено(Объект.ДокументОснование) Тогда
		
		ДокОбъект = РеквизитФормыВЗначение("Объект");
		// ДокОбъект.Заполнить(Новый Структура("ДокументОснование, ТипЛогистика",
		//									ДокОбъект.ДокументОснование));
		ЗначениеВРеквизитФормы(ДокОбъект, "Объект");
		Модифицированность = Истина;

	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуПодбораСущностиЛогистика(Знач ОбъектУчетнойСистемы, Знач Элемент)

	ПараметрыФормыПоиска = Новый Структура();
	ПараметрыФормыПоиска.Вставить("ОбъектУчетнойСистемы", ОбъектУчетнойСистемы);

	ПараметрыОбработчика = Новый Структура();
	ПараметрыОбработчика.Вставить("ИмяЭлементаФормы", Элемент.Имя);

	Если Элемент.Имя = "ДокУчСист_Грузоотправитель_Сопоставить"
		 Или Элемент.Имя = "ДокУчСист_Перевозчик_Сопоставить" Тогда

		ИмяСущности = "КонтурЛогистика_ОрганизацииДиадок";

	ИначеЕсли Элемент.Имя = "ДокУчСист_ПунктПод_Сопоставить" Тогда

		ИмяСущности = "КонтурЛогистика_ПунктыМаршрута";

	Иначе

		ВызватьИсключение "не реализовано";

	КонецЕсли;

	КонтурЛогистика_ОбщегоНазначенияКлиент.ОткрытьФорму_Подсистемы("Справочник." + ИмяСущности + ".ФормаВыбора",
																   ПараметрыФормыПоиска,
																   ЭтаФорма,
																   ЭтаФорма,
																   "ОбработчикВыбораСопоставленияРеквизитаДокумента",
																   ПараметрыОбработчика);
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикВыбораСопоставленияРеквизитаДокумента(ВыбранноеЗначение, ДопПараметры) Экспорт

	Если ВыбранноеЗначение <> Неопределено Тогда 
		
		// Выполнить переконвертацию или присваивание

		ПолностьюОбновитьПредставлениеДанных();

		ОбновитьДанныеФормы();

	КонецЕсли;

КонецПроцедуры

&НаСервереБезКонтекста
Функция СоответствиеКонвертируемыхРеквизитовИзДокУчСист()

	Перем МассивКонвертируемыхРеквизитов;

	МассивКонвертируемыхРеквизитов = Новый Соответствие();
	МассивКонвертируемыхРеквизитов.Вставить("ПунктПод", "ПунктПод");
	МассивКонвертируемыхРеквизитов.Вставить("Грузоотправитель", "Грузоотправитель");
	МассивКонвертируемыхРеквизитов.Вставить("Перевозчик", "Перевозчик");
	
	Возврат МассивКонвертируемыхРеквизитов;

КонецФункции

&НаКлиенте
Процедура ПоказатьЗначенияДокументаУчетнойСистемы(Команда)
	
	РеквизитыУчетногоДокументаВидимы = Не РеквизитыУчетногоДокументаВидимы;
	Если РеквизитыУчетногоДокументаВидимы Тогда 
		Элементы.ФормаПоказатьЗначенияДокументаУчетнойСистемы.Картинка = БиблиотекаКартинок.КонтурЛогистика_Скрыть;
	Иначе
		Элементы.ФормаПоказатьЗначенияДокументаУчетнойСистемы.Картинка = БиблиотекаКартинок.КонтурЛогистика_Показать;
	КонецЕсли;
	
	СкрытьПоказатьЗначенияДокУчСист();
	
КонецПроцедуры

&НаКлиенте
Процедура СкрытьПоказатьЗначенияДокУчСист()
	
	ЗаполнитьПредставлениеРеквизитовДокументаОснования();

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПредставлениеРеквизитовДокументаОснования()

	МассивКонвертируемыхРеквизитов = СоответствиеКонвертируемыхРеквизитовИзДокУчСист();
	Представления = ПолучитьПредставлениеРеквизитовДокументаОснования(Объект.ДокументОснование, Объект);
	
	Для Каждого Эл Из МассивКонвертируемыхРеквизитов Цикл
		
		Значение = Неопределено;
		ИмяЭлементаЛогистика = Эл.Значение; // сконвертированного
		ИмяЭлементаНадписиСопоставить = "ДокУчСист_" + Эл.Ключ + "_Сопоставить";
		ИмяЭлементаЗначениеИзДокУчСист = "ДокУчСист_" + Эл.Ключ;
		
		
		Если Представления.Свойство(Эл.Ключ, Значение) Тогда
			
			ЭтаФорма["ДокУчСист_" + Эл.Ключ] = Значение;			
			// определим доступность команды сопоставления
			
			Если ЗначениеЗаполнено(ИмяЭлементаЛогистика) Тогда
				
				ПутьПроверкиДанных = Элементы.Найти(ИмяЭлементаЛогистика).ПутьКДанным;
				
				РеквизитИзвлеченИзДокумента = ЗначениеЗаполнено(Этаформа[ИмяЭлементаЗначениеИзДокУчСист]);
				
				Если РеквизитИзвлеченИзДокумента Тогда // если этот элемент выведен на форму и он рассчитан из документа уч сист
					
					Если Элементы.Найти(ИмяЭлементаЛогистика) <> Неопределено Тогда
						
						ЗначениеВРеквизите = Вычислить(ПутьПроверкиДанных);
						НужноСопоставить = Не ЗначениеЗаполнено(ЗначениеВРеквизите);
						
					Иначе
						
						НужноСопоставить = Ложь;
						
					КонецЕсли;
					
					Элементы.Найти(ИмяЭлементаЛогистика).Видимость = Не НужноСопоставить;
					Элементы.Найти(ИмяЭлементаНадписиСопоставить).Видимость = НужноСопоставить;
					Элементы.Найти(ИмяЭлементаЗначениеИзДокУчСист).Видимость = НужноСопоставить ИЛИ РеквизитыУчетногоДокументаВидимы;
					Элементы.Найти(ИмяЭлементаНадписиСопоставить).Заголовок = "Сопоставить";
					Элементы.Найти(ИмяЭлементаНадписиСопоставить).Подсказка = "Установить новое соответствие";
					
				Иначе // не извлечен из документа Уч сист
					
					Элементы.Найти(ИмяЭлементаЗначениеИзДокУчСист).Видимость = Ложь;
					Элементы.Найти(ИмяЭлементаНадписиСопоставить).Видимость = Ложь;
					
					Если ЗначениеЗаполнено(Объект.ДокументОснование) Тогда
						
						Элементы.Найти(ИмяЭлементаНадписиСопоставить).Подсказка = "Не извлечен или не заполнен в док. основании. Открыть исходный документ";
						
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЕсли;
			
		Иначе
			
			Если Элементы.Найти(ИмяЭлементаЛогистика) <> Неопределено Тогда
				Элементы.Найти(ИмяЭлементаЛогистика).Видимость 	= Истина;
			КонецЕсли;
			
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьПредставлениеРеквизитовДокументаОснования(ДокументОснование, Знач ДокументТитулОбъект)

	МассивКонвертируемыхРеквизитов = СоответствиеКонвертируемыхРеквизитовИзДокУчСист();

	СтруктураПредставлений = Новый Структура();
	Для Каждого Эл Из МассивКонвертируемыхРеквизитов Цикл
		СтруктураПредставлений.Вставить(Эл.Ключ);
	КонецЦикла;
	
	Если ЗначениеЗаполнено(ДокументОснование) Тогда
		
		НастройкаКонвертации = Справочники.КонтурЛогистика_НастройкиКонвертацииДокументов.ПолучитьНастройкуКонвертации(
									Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ЗЗ_Титул1,
									ДокументОснование);
		
		Если НастройкаКонвертации <> Неопределено Тогда
			
			Переменные = КонтурЛогистика_КонвертацияСервер.ДвижокКонвертации_ВычислитьПеременные(ДокументТитулОбъект, ДокументОснование, НастройкаКонвертации, "");
			
			Для Каждого Эл Из МассивКонвертируемыхРеквизитов Цикл
				
				НастройкаКонвертацииРеквизита = НастройкаКонвертации.ПравилаКонвертацииТитулаРеквизиты.Найти(Эл.Ключ,
					"РеквизитТитула");
					ТекущийОбъектДляВычисления = ДокументТитулОбъект;
				
				Если НастройкаКонвертацииРеквизита = Неопределено Тогда 
					Сообщить("В настройках конвертации документов не указано правило конвертации для реквизита: " + Эл.Ключ);
					Продолжить;
				КонецЕсли;	
				
				РезультатВычисления = КонтурЛогистика_КонвертацияСервер.ДвижокКонвертации_ВычислитьРеквизитОснования(ДокументОснование,
					НастройкаКонвертацииРеквизита,
					НастройкаКонвертации,
					ТекущийОбъектДляВычисления,
					Ложь,
					Переменные);
				
				Если РезультатВычисления.Успешно Тогда
					СтруктураПредставлений.Вставить("ДокУчСист_" + Эл.Ключ, РезультатВычисления.Значение);
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЕсли;

	Возврат СтруктураПредставлений;

КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьПараметрыПодписиНаСервере(ОрганизацияДиадок, Пользователь1С, ДопПараметр)
	
	ДатаПодписи = ТекущаяДатаСеанса();
	
	// получаем из среза 
	ПодписантСтруктура = РегистрыСведений.КонтурЛогистика_НастройкиПодписания.ВыбратьПодписанта(ОрганизацияДиадок, Пользователь1С, 
		ДатаПодписи, , ДопПараметр);
	
	СтруктураЗаписи = Новый Структура("ОрганизацияДиадок, Пользователь1С, СертификатНаСервере, ДопПараметр, Период",
				ОрганизацияДиадок, ПодписантСтруктура.Пользователь1С, ПодписантСтруктура.ЭтоСерверныйСертификат,
				ПодписантСтруктура.ДопПараметр, ПодписантСтруктура.ДатаЗаписи);
			
	МассивКонструктораКлюча = Новый Массив;
	МассивКонструктораКлюча.Добавить(СтруктураЗаписи);
	
	Возврат МассивКонструктораКлюча;		
	
КонецФункции

&НаСервере
Процедура ЗаполнитьГрузыПоМаршрутам()
	
	Если Не ЗначениеЗаполнено(Объект.Титул1) Тогда
		Возврат ; 
	КонецЕсли;
	
 	Запрос = Новый Запрос;
 	Запрос.Текст = "ВЫБРАТЬ
 	|	КонтурЛогистика_ПЭ_ЗаявкаНаМаршрутТовары.ОтгрузочноеНаименование КАК Наименование,
 	|	КонтурЛогистика_ПЭ_ЗаявкаНаМаршрутТовары.КоличествоМест КАК КоличествоМест,
 	|	КонтурЛогистика_ПЭ_ЗаявкаНаМаршрутТовары.ОбъемКубМ КАК Объем,
 	|	КонтурЛогистика_ПЭ_ЗаявкаНаМаршрутТовары.МассаБруттоКг КАК МассаБрутто,
 	|	КонтурЛогистика_ПЭ_ЗаявкаНаМаршрутТовары.СтоимостьГруза КАК Стоимость,
 	|	КонтурЛогистика_ПЭ_ЗаявкаНаМаршрутТовары.ВалютаУчетаГруза КАК Валюта,
 	|	КонтурЛогистика_ПЭ_ЗаявкаНаМаршрутТовары.Ссылка КАК Ссылка,
 	|	КонтурЛогистика_ПЭ_ЗаявкаНаМаршрутТовары.Ссылка.СвГО КАК СвГО,
 	|	КонтурЛогистика_ПЭ_ЗаявкаНаМаршрутТовары.Ссылка.СвГП КАК СвГП,
 	| 	КонтурЛогистика_ПЭ_ЗаявкаНаМаршрутТовары.Ссылка.АдрГруз КАК АдрГруз,
 	| 	КонтурЛогистика_ПЭ_ЗаявкаНаМаршрутТовары.Ссылка.АдрПунктНазн КАК АдрПунктНазн,
 	|	КонтурЛогистика_ПЭ_ЗаявкаНаМаршрутТовары.Ссылка.УказКлнт.ТемпНеНиже КАК ТемпНеНиже,
 	|	КонтурЛогистика_ПЭ_ЗаявкаНаМаршрутТовары.Ссылка.УказКлнт.ТемпНеВыше КАК ТемпНеВыше,
 	|	КонтурЛогистика_ПЭ_ЗаявкаНаМаршрутТовары.Ссылка.УказКлнт.ВлажнНеНиже КАК ВлажнНеНиже,
 	|	КонтурЛогистика_ПЭ_ЗаявкаНаМаршрутТовары.Ссылка.УказКлнт.СрокДостГр КАК СрокДостГр,
 	| 	КонтурЛогистика_ПЭ_ЗаявкаНаМаршрутТовары.Ссылка.УказКлнт.ВлажнНеВыше КАК ВлажнНеВыше,
 	| 	КонтурЛогистика_ПЭ_ЗаявкаНаМаршрутТовары.Ссылка.УказКлнт.ОгрСкор КАК ОгрСкор,
 	| 	КонтурЛогистика_ПЭ_ЗаявкаНаМаршрутТовары.Ссылка.УказКлнт.УкНормПрвз КАК УкНормПрвз,
 	| 	КонтурЛогистика_ПЭ_ЗаявкаНаМаршрутТовары.Ссылка.УказКлнт.Отмет КАК Отмет,
 	|	НЕ
 	|		КонтурЛогистика_ПЭ_ЗаявкаНаМаршрутТовары.Ссылка.УказКлнт = ЗНАЧЕНИЕ(Справочник.КонтурЛогистика_ОсобыеУсловияПеревозки.ПустаяСсылка) КАК
 	|		ЕстьОсобыеУсловияПеревозки,
 	|	КонтурЛогистика_ПЭ_ЗаявкаНаМаршрутТовары.Ссылка.ПрзПрвз = ЗНАЧЕНИЕ(Перечисление.КонтурЛогистика_ВариантыПодачиКонтейнера.ПодачаПорожнегоКонтейнераГрузоотправителю)
 	|	ИЛИ
 	|		КонтурЛогистика_ПЭ_ЗаявкаНаМаршрутТовары.Ссылка.ПрзПрвз = ЗНАЧЕНИЕ(Перечисление.КонтурЛогистика_ВариантыПодачиКонтейнера.ПриемКПеревозкеГруженогоКонтейнера) КАК
 	|		ЕстьДанныеОконтейнерах,
 	|	НЕ
 	|		КонтурЛогистика_ПЭ_ЗаявкаНаМаршрутТовары.СвОпаснГруз = ЗНАЧЕНИЕ(Справочник.КонтурЛогистика_ОписанияОпасныхГрузов.ПустаяСсылка) КАК
 	|		Опасный,
 	|	КонтурЛогистика_ПЭ_ЗаявкаНаМаршрутТовары.УчГосСист КАК Госучет,
 	|	КонтурЛогистика_ПЭ_ЗаявкаНаМаршрутТовары.ПрзИзъятВещ КАК ОграниченВОбороте,
 	|	КонтурЛогистика_ПЭ_ЗаявкаНаМаршрутТовары.ИдентификаторСтроки КАК ИдентификаторСтроки,
 	|	КонтурЛогистика_ПЭ_ЗаявкаНаМаршрутТовары.Ссылка.МаршСлГруз КАК МаршрутСледованияГруза
 	|ИЗ
 	|	Документ.КонтурЛогистика_ПЭ_ЗаявкаНаМаршрут.Товары КАК КонтурЛогистика_ПЭ_ЗаявкаНаМаршрутТовары
 	|ГДЕ
 	|	КонтурЛогистика_ПЭ_ЗаявкаНаМаршрутТовары.Ссылка.Титул1 = &Титул1
 	|	И КонтурЛогистика_ПЭ_ЗаявкаНаМаршрутТовары.Ссылка.Титул1.ПометкаУдаления = ЛОЖЬ
 	|	И КонтурЛогистика_ПЭ_ЗаявкаНаМаршрутТовары.Ссылка.ПометкаУдаления = ЛОЖЬ
 	|ИТОГИ
 	|	МАКСИМУМ(Ссылка) КАК Наименование,
 	|	СУММА(КоличествоМест),
 	|	СУММА(Объем),
 	|	СУММА(МассаБрутто),
 	|	СУММА(Стоимость),
 	|	МАКСИМУМ(Валюта),
 	|	МАКСИМУМ(Опасный),
 	|	МАКСИМУМ(Госучет),
 	|	МАКСИМУМ(ОграниченВОбороте),
 	|	МАКСИМУМ(ЕстьДанныеОКонтейнерах),
 	|	МАКСИМУМ(ЕстьОсобыеУсловияПеревозки),
 	|	МАКСИМУМ(СвГО),
 	|   МАКСИМУМ(СвГП),
 	|	МАКСИМУМ(АдрГруз),
 	|	МАКСИМУМ(АдрПунктНазн),
 	|	МАКСИМУМ(ТемпНеНиже),
 	|	МАКСИМУМ(ТемпНеВыше),
 	|	МАКСИМУМ(ВлажнНеНиже),
 	|	МАКСИМУМ(СрокДостГр),
 	|	МАКСИМУМ(ОгрСкор),
 	|	МАКСИМУМ(ВлажнНеВыше),
 	|	МАКСИМУМ(ОгрСкор),
 	|	МАКСИМУМ(УкНормПрвз),
 	|	МАКСИМУМ(Отмет)
 	|ПО
 	|	Ссылка";
 	
 	Запрос.УстановитьПараметр("Титул1", Объект.Титул1);
 	ДЗДанныеТоваров = Запрос.Выполнить().Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Строка100 = Новый ОписаниеТипов("Строка", , , Новый КвалификаторыСтроки(100));
	ДЗДанныеТоваров.Колонки.Добавить("ПредставлениеДатаВремяОтгрузка", Строка100);
	ДЗДанныеТоваров.Колонки.Добавить("ПредставлениеДатаВремяДоставка", Строка100);
	ДЗДанныеТоваров.Колонки.Добавить("ВидТранспорта", Строка100);
	ДЗДанныеТоваров.Колонки.Добавить("ТипКузова", Строка100);
 	
 	Для Каждого СтрокаДЗ ИЗ ДЗДанныеТоваров.Строки Цикл
 	
 		СтрокаДЗ.ПредставлениеДатаВремяОтгрузка = СформироватьПредставлениеВремени(СтрокаДЗ, "Отгрузка");
 		СтрокаДЗ.ПредставлениеДатаВремяДоставка = СформироватьПредставлениеВремени(СтрокаДЗ, "Доставка");
 		
 		ПредставлениеТранспорта = СформироватьПредставлениеВидаТранспорта(СтрокаДЗ);
 		СтрокаДЗ.ВидТранспорта = ПредставлениеТранспорта.ВидТранспорта;
 		СтрокаДЗ.ТипКузова = ПредставлениеТранспорта.ТипКузова;
 		 
 	КонецЦикла; 	
 	
 	ЗначениеВРеквизитФормы(ДЗДанныеТоваров, "Грузы");
 	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеПоУпаковкамГруза()
	
	Запрос = Новый Запрос;
 	Запрос.Текст = "ВЫБРАТЬ
 	|	КонтурЛогистика_ПЭ_ЗаявкаНаМаршрутИнфУпГруз.Ссылка КАК Ссылка,
 	|	КонтурЛогистика_ПЭ_ЗаявкаНаМаршрутИнфУпГруз.ИдентификаторСтрокиТоваров КАК ИдентификаторСтроки,
 	|	КонтурЛогистика_ПЭ_ЗаявкаНаМаршрутИнфУпГруз.ВидУпак КАК ВидУпак,
 	|	КонтурЛогистика_ПЭ_ЗаявкаНаМаршрутИнфУпГруз.ВесУпак КАК ВесУпак,
 	|	КонтурЛогистика_ПЭ_ЗаявкаНаМаршрутИнфУпГруз.КолУпак КАК КолУпак,
 	|	КонтурЛогистика_ПЭ_ЗаявкаНаМаршрутИнфУпГруз.ВысЗнач КАК ВысЗнач,
 	|	КонтурЛогистика_ПЭ_ЗаявкаНаМаршрутИнфУпГруз.ДлЗнач КАК ДлЗнач,
 	|	КонтурЛогистика_ПЭ_ЗаявкаНаМаршрутИнфУпГруз.ШирЗнач КАК ШирЗнач
 	|ИЗ
 	|	Документ.КонтурЛогистика_ПЭ_ЗаявкаНаМаршрут.ИнфУпГруз КАК КонтурЛогистика_ПЭ_ЗаявкаНаМаршрутИнфУпГруз
 	|ГДЕ
 	|	КонтурЛогистика_ПЭ_ЗаявкаНаМаршрутИнфУпГруз.Ссылка.Титул1 = &Титул1
 	|ИТОГИ
 	|ПО
 	|	Ссылка";
 	
 	ТЗ_Упаковки = РеквизитФормыВЗначение("УпаковкаТовара");
	ТЗ_Упаковки.Очистить();
 	
 	Запрос.УстановитьПараметр("Титул1", Объект.Титул1);
 	Выборка = Запрос.Выполнить().Выбрать();
 	
 	Пока Выборка.Следующий() Цикл
 		
 		НоваяСтрока = ТЗ_Упаковки.Добавить();
 		НоваяСтрока.ВидТары = Выборка.ВидУпак;
 		НоваяСтрока.ИдентификаторСтроки = Выборка.ИдентификаторСтроки;
 		НоваяСтрока.Количество = Выборка.КолУпак;
 		НоваяСтрока.Вес = Выборка.ВесУпак;
 		НоваяСтрока.Размер  =  ПолучитьПредставлениеРазмера(Выборка.ДлЗнач, Выборка.ШирЗнач, Выборка.ВысЗнач); 
 		
 	КонецЦикла; 	
 	
 	ЗначениеВРеквизитФормы(ТЗ_Упаковки, "УпаковкаТовара");

КонецПроцедуры	

&НаСервере
Функция ПолучитьПредставлениеРазмера(Длина, Ширина, Высота)
	
	ФорматнаяСтрока = "ЧН=0; ЧГ=";
	
	Возврат Формат(Длина, ФорматнаяСтрока) + " х " + Формат(Ширина, ФорматнаяСтрока) + " х " + Формат(Высота, ФорматнаяСтрока);  
	
КонецФункции	

&НаСервере
Функция СформироватьПредставлениеВремени(Данные, НаправлениеОперации);
	
	Если НаправлениеОперации = "Отгрузка" Тогда 
		Префикс = "Отгр";
	Иначе
		Префикс = "ДостГр"; 
	КонецЕсли;
	
	ДатаС = Данные.Ссылка["Дат" + Префикс + "С"];
	ДатаПо = Данные.Ссылка["Дат" + Префикс + "По"];
	ФорматнаяСтрока = "ДФ=dd.MM.yy";
	
	ПредставлениеДата = СформироватьПредставление(ДатаС, ДатаПо, ФорматнаяСтрока);
			 
	ВремяС = Данные.Ссылка["Вр" + Префикс + "С"];
	ВремяПо = Данные.Ссылка["Вр" + Префикс + "По"];
	ФорматнаяСтрока = "ДФ=HH:mm";
	
	ПредставлениеВремени = СформироватьПредставление(ВремяС, ВремяПо, ФорматнаяСтрока);
	
	Если ЗначениеЗаполнено(ПредставлениеВремени) 
		И ЗначениеЗаполнено(ПредставлениеДата) Тогда	
		 
		Результат = ПредставлениеДата + ", " + ПредставлениеВремени;
	Иначе 
		Результат = ПредставлениеДата + ПредставлениеВремени;	
	КонецЕсли;	 
		
	Возврат Результат; 
	
КонецФункции

&НаСервере
Функция СформироватьПредставление(ЗначениеС, ЗначениеПо, ФорматнаяСтрока)
	
	Если ЗначениеЗаполнено(ЗначениеС)
		И ЗначениеЗаполнено(ЗначениеПо) Тогда
			
		Если ЗначениеС = ЗначениеПо Тогда 
			ПредставлениеЗначение = Формат(ЗначениеС, ФорматнаяСтрока);	
		Иначе 	
			ПредставлениеЗначение = Формат(ЗначениеС, ФорматнаяСтрока) + " - " + Формат(ЗначениеПо, ФорматнаяСтрока);
		КонецЕсли;
		 	
	ИначеЕсли ЗначениеЗаполнено(ЗначениеС) Тогда 
		
		ПредставлениеЗначение = "с " + Формат(ЗначениеС, ФорматнаяСтрока);
	
	ИначеЕсли ЗначениеЗаполнено(ЗначениеПо) Тогда 
		
		ПредставлениеЗначение = "до " + Формат(ЗначениеПо, ФорматнаяСтрока);
	
	Иначе
			
		ПредставлениеЗначение = "";	
			
	КонецЕсли;
	
	Возврат ПредставлениеЗначение;
	
КонецФункции	

&НаСервере
Функция СформироватьПредставлениеВидаТранспорта(Данные)
	
	Результат = Новый Структура("ВидТранспорта, ТипКузова", "", ""); 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 	"ВЫБРАТЬ
	|	КонтурЛогистика_ПЭ_ЗаявкаНаМаршрутВидТС.ВидТС КАК ВидТС,
	|	КонтурЛогистика_ПЭ_ЗаявкаНаМаршрутВидТС.ТипКузов КАК ТипКузов
	|ИЗ
	|	Документ.КонтурЛогистика_ПЭ_ЗаявкаНаМаршрут.ВидТС КАК КонтурЛогистика_ПЭ_ЗаявкаНаМаршрутВидТС
	|ГДЕ
	|	КонтурЛогистика_ПЭ_ЗаявкаНаМаршрутВидТС.Ссылка = &Маршрут";
	
	Запрос.УстановитьПараметр("Маршрут", Данные.Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Если ЗначениеЗаполнено(Результат.ВидТранспорта) Тогда 
			 Результат.ВидТранспорта = Результат.ВидТранспорта + ";";
			 Результат.ТипКузова = Результат.ТипКузова + ";";
		КонецЕсли;
		 
		Результат.ВидТранспорта = Результат.ВидТранспорта + Строка(Выборка.ВидТС);
		Результат.ТипКузова = Результат.ТипКузова + Выборка.ТипКузов;
		
	КонецЦикла;
	
	Если Результат.ВидТранспорта = "" Тогда 
		Результат.ВидТранспорта = " - ";
	КонецЕсли;	
	 	
	Если Результат.ТипКузова = "" Тогда 
		Результат.ТипКузова = " - ";
	КонецЕсли;	
		
	Возврат Результат;	
	
КонецФункции

&НаСервере
Процедура ДобавитьУслугуНаСервере(Данные)

	НоваяУслуга = Объект.ДопИнфЭксп.Добавить();
	ЗаполнитьЗначенияСвойств(НоваяУслуга, Данные.Услуга);
	НоваяУслуга.РекИдПредст = Данные.Услуга.ОрганизацияДиадок;
	НоваяУслуга.ПризИсп = ?(Данные.Услуга.Исполнитель, Перечисления.КонтурЛогистика_ТипИсполненияЭкспСвоихОбязательст._1, 
			Перечисления.КонтурЛогистика_ТипИсполненияЭкспСвоихОбязательст._2);
	НоваяУслуга.ИдентификаторСтроки = Строка(Новый УникальныйИдентификатор());
	
	СтрокаМаршрут = Объект.СвТрсГруз.Добавить();
	СтрокаМаршрут.ИдентификаторСтрокиРодитель = НоваяУслуга.ИдентификаторСтроки;
	СтрокаМаршрут.ИдентификаторСтроки = Строка(Новый УникальныйИдентификатор());
	Если ЗначениеЗаполнено(Данные.Маршрут) Тогда
		СтрокаМаршрут.Маршрут = Данные.Маршрут;
		СтрокаМаршрут.ИдентПартГруз = Данные.Маршрут.ИдПарт;
		СтрокаМаршрут.НомПартГруз = Данные.Маршрут.НомПарт;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Данные.Услуга.ТипТранспорта) Тогда
		ЗаполнитьТранспортВодителей(Данные, СтрокаМаршрут.ИдентификаторСтроки);
	КонецЕсли;
	
	ЗаполнитьТаблицуУслуг();
	ЗаполнитьТаблицуТСиВодители();
	
КонецПроцедуры	

&НаСервере
Процедура ЗаполнитьТранспортВодителей(Данные, ИдентификаторСтроки)
	
	ОчиститьТранспортВодителейПоИдентификатору(ИдентификаторСтроки);
	
	Если Данные.Услуга.ТипТранспорта = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ВидыТранспорта._1") Тогда
		
		Для Каждого Транспорт Из Данные.ТранспортВодители Цикл 
		
			НовоеТС = Объект.СвТсДост.Добавить();
			НовоеТС.ВидТС = Данные.Услуга.ТипТранспорта;
			НовоеТС.ИдентификаторСтрокиРодитель = ИдентификаторСтроки;	
			НовоеТС.ИдентификаторСтроки = Транспорт.ИдентификаторСтроки;
			НовоеТС.ТранспортноеСредство = Транспорт.ТС;
			
			Для Каждого Водитель Из Транспорт.МассивВодителей Цикл
				НовыйВодитель = Объект.Водители.Добавить();
				НовыйВодитель.ИдентификаторСтрокиРодитель = НовоеТС.ИдентификаторСтроки;	
				НовыйВодитель.Водитель = Водитель;
			КонецЦикла; 	
		
		КонецЦикла;
		
	Иначе 
		НовоеТС = Объект.СвТсДост.Добавить();
		НовоеТС.ВидТС = Данные.Услуга.ТипТранспорта;
		НовоеТС.ИдентификаторСтрокиРодитель = ИдентификаторСтроки;	
	КонецЕсли; 	 
	
КонецПроцедуры	

&НаСервере
Процедура ОчиститьТранспортВодителейПоИдентификатору(ИдентификаторСтроки)
	
	Отбор = Новый Структура("ИдентификаторСтрокиРодитель", ИдентификаторСтроки);
	МассивСтрок = Объект.СвТсДост.НайтиСтроки(Отбор);
	
	Для Каждого ТС Из МассивСтрок Цикл
		
		Отбор = Новый Структура("ИдентификаторСтрокиРодитель", ТС.ИдентификаторСтроки);
		МассивСтрокВ = Объект.Водители.НайтиСтроки(Отбор);
		
		Для Каждого Водитель Из МассивСтрокВ Цикл
			Объект.Водители.Удалить(Водитель);
		КонецЦикла;
		
		Объект.СвТсДост.Удалить(ТС);	
 				
	КонецЦикла;	 	
	
КонецПроцедуры	

&НаСервере
Процедура УдалитьУслугуНаСервере(ИдентификаторСтроки)
	
	Отбор = Новый Структура("ИдентификаторСтроки", ИдентификаторСтроки);
	МассивСтрок = Объект.ДопИнфЭксп.НайтиСтроки(Отбор);
	
	Для Каждого Услуга Из МассивСтрок Цикл
		
		Отбор = Новый Структура("ИдентификаторСтрокиРодитель", Услуга.ИдентификаторСтроки);
		МассивСтрокМ = Объект.СвТрсГруз.НайтиСтроки(Отбор);
		
		Для Каждого Маршрут Из МассивСтрокМ Цикл
			ОчиститьТранспортВодителейПоИдентификатору(Маршрут.ИдентификаторСтроки);
			Объект.СвТрсГруз.Удалить(Маршрут);
		КонецЦикла;
		
		Объект.ДопИнфЭксп.Удалить(Услуга);	
 				
	КонецЦикла;
	
КонецПроцедуры	

&НаСервере
Процедура ЗаполнитьТаблицуУслуг()
	
	ДокументОбъект = РеквизитФормыВЗначение("Объект");
	ТЗУслуги = ДокументОбъект.ДопИнфЭксп.Выгрузить();
	ТЗМаршрут = ДокументОбъект.СвТрсГруз.Выгрузить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ВременнаяТаблица.Услуга КАК Услуга,
	|	ВременнаяТаблица.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	ВременнаяТаблица.ОбщСтУсл КАК Стоимость,
	|	ВременнаяТаблица.Количество КАК Количество,
	|	ВременнаяТаблица.Валюта КАК Валюта
	|ПОМЕСТИТЬ Вт_Услуги
	|ИЗ
	|	&УслугаВТ КАК ВременнаяТаблица
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВременнаяТаблица.Маршрут КАК Маршрут,
	|	ВременнаяТаблица.ИдентификаторСтрокиРодитель КАК ИдентификаторСтрокиРодитель,
	|	ВременнаяТаблица.ИдентификаторСтроки КАК ИдентификаторСтрокиМаршрут
	|ПОМЕСТИТЬ ВТ_Маршрут
	|ИЗ
	|	&МаршрутВТ КАК ВременнаяТаблица
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Маршрут.Маршрут КАК Услуга,
	|	ВТ_Маршрут.Маршрут КАК СсылкаМаршрут,
	|	Вт_Услуги.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	Вт_Маршрут.ИдентификаторСтрокиМаршрут КАК ИдентификаторСтрокиМаршрут,
	|	Вт_Услуги.Услуга КАК ПолеИтогов,
	|	Вт_Услуги.Стоимость КАК Стоимость,
	|	Вт_Услуги.Количество КАК Количество,
	|	Вт_Услуги.Валюта КАК Валюта
	|
	|ИЗ
	|	Вт_Услуги КАК Вт_Услуги
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Маршрут КАК ВТ_Маршрут
	|		ПО ВТ_Маршрут.ИдентификаторСтрокиРодитель = Вт_Услуги.ИдентификаторСтроки
	|ИТОГИ
	|   Максимум(ПолеИтогов) КАК Услуга,
	|	Максимум(ИдентификаторСтроки),
	|	СУММА(Стоимость),
	|	Сумма(Количество),
	|	Максимум(Валюта)
	|ПО
	|	Вт_Услуги.Услуга";
	
	Запрос.УстановитьПараметр("УслугаВТ", ТЗУслуги);
	Запрос.УстановитьПараметр("МаршрутВТ", ТЗМаршрут);
	
	ДЗ_Услуги = Запрос.Выполнить().Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	ЗначениеВРеквизитФормы(ДЗ_Услуги, "Услуги");
	
КонецПроцедуры	

&НаСервере
Процедура ЗаполнитьТаблицуТСиВодители()
	
	ДокументОбъект = РеквизитФормыВЗначение("Объект");
	
	ТЗУслуги = ДокументОбъект.ДопИнфЭксп.Выгрузить();
	ТЗМаршрут = ДокументОбъект.СвТрсГруз.Выгрузить();
	ТЗТранспорт = ДокументОбъект.СвТсДост.Выгрузить();
	ТЗВодители = ДокументОбъект.Водители.Выгрузить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ВременнаяТаблица.Услуга КАК Услуга,
	|	ВременнаяТаблица.ИдентификаторСтроки КАК ИдентификаторСтроки
	|ПОМЕСТИТЬ Вт_Услуги
	|ИЗ
	|	&УслугаВТ КАК ВременнаяТаблица
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВременнаяТаблица.Маршрут КАК Маршрут,
	|	ВременнаяТаблица.ИдентификаторСтрокиРодитель КАК ИдентификаторСтрокиРодитель,
	|	ВременнаяТаблица.ИдентификаторСтроки КАК ИдентификаторСтроки
	|ПОМЕСТИТЬ ВТ_Маршрут
	|ИЗ
	|	&МаршрутВТ КАК ВременнаяТаблица
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫРАЗИТЬ(ВременнаяТаблица.ТранспортноеСредство КАК Справочник.КонтурЛогистика_ТранспортныеСредства) КАК Транспорт,
	|	ВременнаяТаблица.ИдентификаторСтрокиРодитель КАК ИдентификаторСтрокиРодитель,
	|	ВременнаяТаблица.ВидТС КАК ВидТС,
	|	ВременнаяТаблица.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	ВременнаяТаблица.РегНомер КАК РегНомер,
	|	ВременнаяТаблица.Марка КАК МаркаТС
	|ПОМЕСТИТЬ ВТ_Транспорт
	|ИЗ
	|	&ТранспортВТ КАК ВременнаяТаблица
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫРАЗИТЬ(ВременнаяТаблица.Водитель КАК Справочник.КонтурЛогистика_Сотрудники) КАК Водитель,
	|	ВременнаяТаблица.ИдентификаторСтрокиРодитель КАК ИдентификаторСтрокиРодитель
	|ПОМЕСТИТЬ ВТ_Водитель
	|ИЗ
	|	&ВодительВТ КАК ВременнаяТаблица
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Водитель.Водитель КАК Водитель,
	|	ВТ_Водитель.Водитель.ТелефонОсновной КАК Телефон1,
	|	ВТ_Водитель.Водитель.ТелефонЗапасной КАК Телефон2,
	|	ВТ_Транспорт.Транспорт КАК Транспорт,
	|	ВТ_Маршрут.Маршрут КАК Маршрут,
	|	ВТ_Маршрут.Маршрут КАК СсылкаМаршрут,
	|	ВТ_Транспорт.ВидТС КАК ВидТранспорта,
	|	ВЫБОР
	|		КОГДА ВТ_Транспорт.Транспорт <> ЗНАЧЕНИЕ(Справочник.КонтурЛогистика_ТранспортныеСредства.ПустаяСсылка)
	|				И НЕ ВТ_Транспорт.Транспорт.РегНомер = """"
	|			ТОГДА ВТ_Транспорт.Транспорт.РегНомер
	|		ИНАЧЕ ВТ_Транспорт.РегНомер
	|	КОНЕЦ КАК ГосНомер,
	|	ВЫБОР
	|		КОГДА ВТ_Транспорт.Транспорт <> ЗНАЧЕНИЕ(Справочник.КонтурЛогистика_ТранспортныеСредства.ПустаяСсылка)
	|				И НЕ ВТ_Транспорт.Транспорт.МаркаТС = """"
	|			ТОГДА ВТ_Транспорт.Транспорт.МаркаТС
	|		ИНАЧЕ ВТ_Транспорт.МаркаТС
	|	КОНЕЦ КАК МаркаТС,
	|	ВТ_Транспорт.ИдентификаторСтрокиРодитель КАК ИдентификаторМаршрут,
	|	ВТ_Транспорт.ИдентификаторСтроки КАК ИдентификаторТранспорт,
	|	ВТ_Маршрут.ИдентификаторСтрокиРодитель КАК ИдентификаторСтроки
	|ИЗ
	|	ВТ_Маршрут КАК ВТ_Маршрут
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Транспорт КАК ВТ_Транспорт
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Водитель КАК ВТ_Водитель
	|			ПО ВТ_Транспорт.ИдентификаторСтроки = ВТ_Водитель.ИдентификаторСтрокиРодитель
	|		ПО ВТ_Маршрут.ИдентификаторСтроки = ВТ_Транспорт.ИдентификаторСтрокиРодитель
	|ГДЕ
	|	НЕ ВТ_Транспорт.ВидТС = ЗНАЧЕНИЕ(Перечисление.КонтурЛогистика_ВидыТранспорта.ПустаяСсылка)
	|ИТОГИ
	|ПО
	|	Маршрут,
	|	Транспорт";
	
	Запрос.УстановитьПараметр("УслугаВТ", ТЗУслуги);
	Запрос.УстановитьПараметр("МаршрутВТ", ТЗМаршрут);
	Запрос.УстановитьПараметр("ТранспортВТ", ТЗТранспорт);
	Запрос.УстановитьПараметр("ВодительВТ", ТЗВодители);
	
	ДЗ_ТранспортФорма = РеквизитФормыВЗначение("ТСиВодители");
	ДЗ_ТранспортФорма.Строки.Очистить();
	ДЗ_Транспорт = Запрос.Выполнить().Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Для Каждого СтрокаДЗ Из ДЗ_Транспорт.Строки Цикл
		Маршрут = ДЗ_ТранспортФорма.Строки.Добавить();  
		Маршрут.Маршрут = СтрокаДЗ.Маршрут;
		Для Каждого СтрокаМаршрута Из СтрокаДЗ.Строки Цикл
			Транспорт = Маршрут.Строки.Добавить();
			ЗаполнитьЗначенияСвойств(Транспорт, СтрокаМаршрута);
			Транспорт.Маршрут = СтрокаМаршрута.Транспорт;
			Для Каждого СтрокаТранспорта Из СтрокаМаршрута.Строки Цикл
				Водитель = Транспорт.Строки.Добавить();
				Водитель.Водитель = СтрокаТранспорта.Водитель;
				Водитель.ИдентификаторСтроки = СтрокаТранспорта.ИдентификаторСтроки;
				Водитель.Телефоны = СформироватьПредставлениеТелефона(СтрокаТранспорта.Телефон1, СтрокаТранспорта.Телефон2); 
			КонецЦикла; 
			Транспорт.ИдентификаторСтроки = СтрокаТранспорта.ИдентификаторСтроки;
			Маршрут.ИдентификаторСтроки = СтрокаТранспорта.ИдентификаторСтроки;
			Маршрут.ИдентификаторМаршрут = СтрокаТранспорта.ИдентификаторМаршрут;
			Транспорт.ИдентификаторМаршрут = СтрокаТранспорта.ИдентификаторМаршрут;
			Транспорт.ИдентификаторТранспорт = СтрокаТранспорта.ИдентификаторТранспорт;
			Маршрут.ИдентификаторТранспорт = СтрокаТранспорта.ИдентификаторТранспорт;
			Маршрут.СсылкаМаршрут = СтрокаТранспорта.СсылкаМаршрут;
			Транспорт.СсылкаМаршрут = СтрокаТранспорта.СсылкаМаршрут;
			Транспорт.ГосНомер = СтрокаТранспорта.ГосНомер;
			Транспорт.Марка = СтрокаТранспорта.МаркаТС;
		КонецЦикла; 	
	КонецЦикла;	
	
	ЗначениеВРеквизитФормы(ДЗ_ТранспортФорма, "ТСиВодители");	
	
КонецПроцедуры	

&НаСервере
Функция СформироватьПредставлениеТелефона(Телефон1, Телефон2)
	
	Если ЗначениеЗаполнено(Телефон1) Тогда
		Результат = Телефон1;
	КонецЕсли;	 
	
	Если ЗначениеЗаполнено(Телефон2) Тогда
		Если ЗначениеЗаполнено(Результат) Тогда 
			Результат = Результат + "; " + Телефон2;
		Иначе
			Результат = Телефон2;
		КонецЕсли;	
	КонецЕсли;	 
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура РазвернутьСвернутьТаблицуТСиВодители()
	
	Для Каждого ЭлементУр1 Из ТСиВодители.ПолучитьЭлементы() Цикл
		Элементы.ТСиВодители.Развернуть(ЭлементУр1.ПолучитьИдентификатор());
		Для Каждого ЭлементУр2 Из ЭлементУр1.ПолучитьЭлементы() Цикл
			Элементы.ТСиВодители.Развернуть(ЭлементУр2.ПолучитьИдентификатор());
		КонецЦикла;	
	КонецЦикла;
	
КонецПроцедуры	

&НаКлиенте
Функция ВходящийПЭ2()
	
	Возврат ТекущийСтатус = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_СтатусыТитулов.Получен")
			ИЛИ ТекущийСтатус = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_СтатусыТитулов.ПолученОбработанСПредупреждением")
			ИЛИ ТекущийСтатус = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_СтатусыТитулов.ПолученТребуетОбработки");
		
КонецФункции

#КонецОбласти

#Область Команды

&НаКлиенте
Процедура КонтурЛогистикаПодключаемый_ВыполнитьКоманду(Команда)
	
    КонтурЛогистика_ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтаФорма, Команда, РеквизитыФормы());
	
КонецПроцедуры

#КонецОбласти

&НаСервере
Функция РеквизитыФормы()
	
	Возврат КонтурЛогистика_ОбщегоНазначенияСервер.РеквизитыФормы(ЭтаФорма);
	
КонецФункции
